Revit 2024 API
FilteredWorksetIterator.Reset Method
 Resets the iterator to the beginning.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator.
See Also
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace